def find_sum(nums, target):
    # Початок визначення функції find_sum з аргументами nums і target
    for i in range(len(nums)):
        # Ітерація по всім елементам списку nums
        for j in range(len(nums)):
            # Ітерація по всім елементам списку nums
            if i == j:
                continue
                # Якщо індекси однакові, переходимо до наступної ітерації циклу
            if nums[i] + nums[j] == target:
                # Перевірка, чи сума елементів з індексами i та j дорівнює цільовому значенню target
                return [i, j]
                # Якщо так, повертаємо індекси цих елементів
    return -1
    # Якщо жодна пара елементів не дорівнює target, повертається -1